{
    "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workbookDisplayName":  {             
            "type":"string",
            "defaultValue": "Multifactor Authentications (MFA)",
            "metadata": {
                "description": "The friendly name for the workbook that is used in the Gallery or Saved List. Needs to be unique in the scope of the resource group and source" 
            }
        },
        "workSpace": {
            "type": "string",
            "defaultValue": "",
            "metadata": {
              "description": "The name of workspace where this workbook will be deployed"
            }
          },
          "workbookId": {
            "type": "string",
            "defaultValue": "[newGuid()]",
            "metadata": {
              "description": "The unique guid for this workbook instance"
            }
          }
    },    
    "resources": [
        {
            "name": "[parameters('workbookId')]",
            "type": "Microsoft.Insights/workbooks",
            "location": "[resourceGroup().location]",
            "kind": "shared",
            "apiVersion": "2018-06-17-preview",
            "dependsOn": [],
            "properties": {
                "displayName": "[parameters('workbookDisplayName')]",
               "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":1,\"content\":{\"json\":\"## Condtional Access Report\\n-------\\n\"},\"name\":\"text - 2\"},{\"type\":9,\"content\":{\"version\":\"KqlParameterItem/1.0\",\"parameters\":[{\"id\":\"a004c359-5130-4023-9993-f830f3a436b4\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"TimeRange\",\"type\":4,\"isRequired\":true,\"value\":{\"durationMs\":7776000000},\"typeSettings\":{\"selectableValues\":[{\"durationMs\":300000},{\"durationMs\":900000},{\"durationMs\":1800000},{\"durationMs\":3600000},{\"durationMs\":14400000},{\"durationMs\":43200000},{\"durationMs\":86400000},{\"durationMs\":172800000},{\"durationMs\":259200000},{\"durationMs\":604800000},{\"durationMs\":1209600000},{\"durationMs\":2419200000},{\"durationMs\":2592000000},{\"durationMs\":5184000000},{\"durationMs\":7776000000}],\"allowCustom\":true},\"timeContext\":{\"durationMs\":86400000}}],\"style\":\"pills\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"parameters - 6\"},{\"type\":12,\"content\":{\"version\":\"NotebookGroup/1.0\",\"groupType\":\"editable\",\"items\":[{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"AuditLogs\\n| where Category == \\\"IdentityProtection\\\"\\n| where OperationName == \\\"Evaluate conditional access policies\\\" \\n| extend ConditionalAccessResultKey =extractjson(\\\"$.[4].key\\\",tostring(AdditionalDetails))\\n| where ConditionalAccessResultKey == \\\"ConditionalAccessResult\\\"\\n| extend ConditionalAccessResult =extractjson(\\\"$.[5].value\\\",tostring(AdditionalDetails))\\n| extend AppliedPolicies =extractjson(\\\"$.[4].value\\\",tostring(AdditionalDetails))\\n| extend B2CPolicy =extractjson(\\\"$.[1].value\\\",tostring(AdditionalDetails))\\n| project CorrelationId,OperationName, B2CPolicy, AppliedPolicies,ConditionalAccessResults=iif(ConditionalAccessResult==\\\"\\\",\\\"N/A\\\",ConditionalAccessResult), Result, AdditionalDetails\\n| join (SigninLogs | project Location, UserDisplayName, UserId, CorrelationId) \\n  on $left.CorrelationId == $right.CorrelationId\\n| project Location, AppliedPolicies, B2CPolicy\\n| summarize  count() by  Location, B2CPolicy\",\"size\":3,\"timeContext\":{\"durationMs\":7776000000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"map\",\"mapSettings\":{\"locInfo\":\"CountryRegion\",\"locInfoColumn\":\"Location\",\"sizeSettings\":\"count_\",\"sizeAggregation\":\"Sum\",\"labelSettings\":\"Location\",\"legendMetric\":\"count_\",\"legendAggregation\":\"Sum\",\"itemColorSettings\":{\"nodeColorField\":\"count_\",\"colorAggregation\":\"Sum\",\"type\":\"heatmap\",\"heatmapPalette\":\"greenRed\"}}},\"name\":\"query - 1\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"\\nAuditLogs\\n| where Category == \\\"IdentityProtection\\\"\\n| where OperationName == \\\"Evaluate conditional access policies\\\" \\n| extend ConditionalAccessResultKey =extractjson(\\\"$.[4].key\\\",tostring(AdditionalDetails))\\n| where ConditionalAccessResultKey == \\\"ConditionalAccessResult\\\"\\n| extend ConditionalAccessResult =extractjson(\\\"$.[4].value\\\",tostring(AdditionalDetails))\\n| extend AppliedPolicies =extractjson(\\\"$.[5].value\\\",tostring(AdditionalDetails))\\n| extend B2CPolicy =extractjson(\\\"$.[1].value\\\",tostring(AdditionalDetails))\\n| project  CorrelationId,OperationName, B2CPolicy, AppliedPolicies=iif(AppliedPolicies==\\\"\\\",\\\"N/A\\\",AppliedPolicies),ConditionalAccessResults=iif(ConditionalAccessResult==\\\"\\\",\\\"N/A\\\",ConditionalAccessResult), Result\\n| summarize count() by B2CPolicy//, AppliedPolicies\\n\",\"size\":0,\"title\":\"Conditional Access Evaluations Per B2C Policy\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"barchart\",\"tileSettings\":{\"titleContent\":{\"columnMatch\":\"B2CPolicy\",\"formatter\":1},\"leftContent\":{\"columnMatch\":\"count_\",\"formatter\":12,\"formatOptions\":{\"palette\":\"auto\"},\"numberFormat\":{\"unit\":17,\"options\":{\"style\":\"decimal\",\"maximumFractionDigits\":2,\"maximumSignificantDigits\":3}}},\"showBorder\":false}},\"name\":\"query - 3\"}]},\"name\":\"group - 6\"},{\"type\":1,\"content\":{\"json\":\"## Conditional Access Evaluations\\n---------------------------------\"},\"name\":\"text - 5\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"\\nAuditLogs\\n| where Category == \\\"IdentityProtection\\\"\\n| where OperationName == \\\"Evaluate conditional access policies\\\" \\n| extend ConditionalAccessResultKey =extractjson(\\\"$.[4].key\\\",tostring(AdditionalDetails))\\n| where ConditionalAccessResultKey == \\\"ConditionalAccessResult\\\"\\n| extend ConditionalAccessResult =extractjson(\\\"$.[4].value\\\",tostring(AdditionalDetails))\\n| extend AppliedPolicies =extractjson(\\\"$.[5].value\\\",tostring(AdditionalDetails))\\n| extend B2CPolicy =extractjson(\\\"$.[1].value\\\",tostring(AdditionalDetails))\\n| project  TimeGenerated, CorrelationId,OperationName, B2CPolicy, AppliedPolicies=iif(AppliedPolicies==\\\"\\\",\\\"N/A\\\",AppliedPolicies),ConditionalAccessResults=iif(ConditionalAccessResult==\\\"\\\",\\\"N/A\\\",ConditionalAccessResult), Result\\n\",\"size\":1,\"timeContext\":{\"durationMs\":7776000000},\"timeContextFromParameter\":\"TimeRange\",\"exportFieldName\":\"CorrelationId\",\"exportParameterName\":\"CorrelationId_\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"gridSettings\":{\"formatters\":[{\"columnMatch\":\"AppliedPolicies\",\"formatter\":18,\"formatOptions\":{\"thresholdsOptions\":\"colors\",\"thresholdsGrid\":[{\"operator\":\"==\",\"thresholdValue\":\"N/A\",\"representation\":\"orange\",\"text\":\"{0}{1}\"},{\"operator\":\"Default\",\"thresholdValue\":null,\"representation\":\"green\",\"text\":\"{0}{1}\"}],\"compositeBarSettings\":{\"labelText\":\"\",\"columnSettings\":[]}}},{\"columnMatch\":\"Result\",\"formatter\":18,\"formatOptions\":{\"thresholdsOptions\":\"icons\",\"thresholdsGrid\":[{\"operator\":\"!=\",\"thresholdValue\":\"success\",\"representation\":\"1\",\"text\":\"{0}{1}\"},{\"operator\":\"Default\",\"thresholdValue\":null,\"representation\":\"success\",\"text\":\"{0}{1}\"}]}}]},\"sortBy\":[]},\"name\":\"query - 2\"},{\"type\":1,\"content\":{\"json\":\"## Details\\n-------\"},\"name\":\"text - 4\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"AuditLogs\\n| where CorrelationId == '{CorrelationId_}'\\n| extend ConditionalAccessResultKey =extractjson(\\\"$.[4].key\\\",tostring(AdditionalDetails))\\n| extend ConditionalAccessResult =extractjson(\\\"$.[4].value\\\",tostring(AdditionalDetails))\\n| extend AppliedPolicies =extractjson(\\\"$.[5].value\\\",tostring(AdditionalDetails))\\n| extend B2CPolicy =extractjson(\\\"$.[1].value\\\",tostring(AdditionalDetails))\\n\\n\\n\",\"size\":1,\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"query - 2\"}],\"isLocked\":false,\"fallbackResourceIds\":[\"/subscriptions/b0e2eadb-68a3-451b-b8e3-4681b9a8368f/resourceGroups/az-woodgrove-rg/providers/Microsoft.OperationalInsights/workspaces/azb2c-woodgrove-logs\"]}",
              "version": "1.0",
                "sourceId": "[concat(resourceGroup().id,'/','providers/Microsoft.OperationalInsights/workspaces','/',parameters('workSpace'))]",
                "category": "workbook"
            }
        }
    ],
    "outputs": {
        "workbookId": {
            "type": "string",
            "value": "[resourceId( 'Microsoft.Insights/workbooks', parameters('workbookId'))]"
        }
    }
}
