{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Risk Detections (Azure AD B2C)\r\n\r\nThis report uses Azure AD B2C Sign-in logs to capture risk detections. \r\n\r\nMore detail on these risk detection and remediation can be found in the article, [Risk detection and remediation](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection#risk-detection-and-remediation).\r\n",
        "style": "info"
      },
      "name": "text - 7"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "fe93a9e0-c664-4934-913b-45a85a4e190b",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "label": "Time Range",
            "type": 4,
            "isRequired": true,
            "value": {
              "durationMs": 5184000000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 10"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "11e980c9-1ea9-4af8-ab25-5212c6c5737e",
            "version": "KqlParameterItem/1.0",
            "name": "FilterByIPAddress",
            "label": "Exclude IPs",
            "type": 2,
            "multiSelect": true,
            "quote": "",
            "delimiter": ",",
            "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| distinct IPAddress",
            "value": [],
            "typeSettings": {
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 5184000000
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 10"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//Shows Risk Detections (Latency: https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-reports-latencies)\n// Only realtime time event gets logged in SignIn log\nSigninLogs\n| where RiskLevelAggregated != \"none\"\n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| project TimeGenerated, CorrelationId,  IPAddress, Location, UserDisplayName, RiskEventTypes_V2, RiskEventTypes, RiskDetail, RiskState, IsRisky, RiskLevelAggregated, UserId\n| summarize count() by RiskLevelAggregated\n\n",
        "size": 1,
        "showAnalytics": true,
        "title": "Aggregated Risk Levels",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart"
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//RiskLevelDuringSignIn\nSigninLogs\n| where RiskLevelDuringSignIn != \"none\"\n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| project TimeGenerated, CorrelationId,  IPAddress, Location, UserDisplayName, RiskEventTypes_V2, RiskEventTypes, RiskDetail, RiskState, IsRisky, RiskLevelAggregated, RiskLevelDuringSignIn, UserId\n| summarize count() by RiskLevelDuringSignIn",
        "size": 1,
        "showAnalytics": true,
        "title": "Risk Levels During SignIn",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Count",
              "formatter": 4,
              "formatOptions": {
                "showIcon": true,
                "aggregation": "Count"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "style": "decimal"
                }
              }
            }
          ],
          "filter": true
        },
        "sortBy": []
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| extend RiskEvent = tolower(RiskEventTypes_V2)\n| summarize Total=count() by RiskEvent, IPAddress\n| order by Total",
        "size": 1,
        "showAnalytics": true,
        "title": "Risk Events with IP Address",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Total",
              "formatter": 8,
              "formatOptions": {
                "palette": "orangeRed"
              }
            },
            {
              "columnMatch": "Count",
              "formatter": 4,
              "formatOptions": {
                "aggregation": "Count"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "style": "decimal"
                }
              }
            }
          ],
          "filter": true
        },
        "sortBy": []
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 1 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where RiskState != \"none\"\r\n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\r\n| project TimeGenerated, CorrelationId,  IPAddress, Location, UserDisplayName, RiskEventTypes_V2, RiskEventTypes, RiskDetail, RiskState, IsRisky, RiskLevelAggregated, UserId\r\n| summarize count() by  Location\r\n",
        "size": 0,
        "showAnalytics": true,
        "title": "Risky Sign Ins By Location",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "map",
        "mapSettings": {
          "locInfo": "CountryRegion",
          "locInfoColumn": "Location",
          "sizeSettings": "count_",
          "sizeAggregation": "Sum",
          "labelSettings": "Location",
          "legendMetric": "count_",
          "legendAggregation": "Sum",
          "itemColorSettings": {
            "nodeColorField": "count_",
            "colorAggregation": "Sum",
            "type": "heatmap",
            "heatmapPalette": "greenRed"
          }
        }
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| extend RiskEvent = tolower(RiskEventTypes_V2)\n| summarize Total=count() by RiskEventTypes_V2\n| order by Total",
        "size": 1,
        "showAnalytics": true,
        "title": "Risk Events - Summary (select Risk Event to view details in the grid view below)",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showRefreshButton": true,
        "exportFieldName": "RiskEventTypes_V2",
        "exportParameterName": "RiskEventTypes_V2Param",
        "exportDefaultValue": "",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Total",
              "formatter": 8,
              "formatOptions": {
                "palette": "coldHot"
              }
            },
            {
              "columnMatch": "Count",
              "formatter": 4,
              "numberFormat": {
                "unit": 17,
                "options": {
                  "style": "decimal"
                }
              }
            }
          ],
          "filter": true
        },
        "sortBy": []
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| extend RiskEvent = tolower(RiskEventTypes_V2)\n| extend locationDetailsJSON = parse_json(LocationDetails)\n| extend Latitude=tostring(locationDetailsJSON.geoCoordinates.latitude), Longitude=tostring(locationDetailsJSON.geoCoordinates.longitude)\n| extend User = tolower(Identity)\n| summarize Total = count() by Latitude, Longitude, User\n| extend GeoCoordinatesMapLink = strcat(\"https://bing.com/maps/default.aspx?cp=\",Latitude,\"~\",Longitude,\"&style=h&lvl=15&sp=\",\"point.\",Latitude,\"_\",Longitude,\"_\",User)\n| project  Latitude, Longitude, GeoCoordinatesMapLink, Total\n| order by Total desc\n\n//| extend Latitude=tostring(locationDetailsJSON.geoCoordinates.latitude), Longitude=tostring(locationDetailsJSON.geoCoordinates.longitude)\n//| extend GeoCoordinatesLink = strcat(\"https://bing.com/maps/default.aspx?cp=\",Latitude,\"~\",Longitude,\"&style=h&lvl=15&sp=\",\"point.\",Latitude,\"_\",Longitude,\"_\",Identity)\n//| project TimeGenerated,  RiskEvent,  RiskLevelAggregated, UserId, Identity, IPAddress, Location,  Latitude, Longitude, BingMapLink=GeoCoordinatesLink",
        "size": 0,
        "showAnalytics": true,
        "title": "Risk Events - Geo Coordinates ",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "exportedParameters": [
          {
            "fieldName": "RiskEventTypes",
            "parameterName": "RiskEventTypes",
            "parameterType": 1
          },
          {
            "fieldName": "UserDisplayName",
            "parameterName": "UserDisplayName",
            "parameterType": 1
          }
        ],
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Total",
              "formatter": 8,
              "formatOptions": {
                "palette": "coldHot"
              }
            },
            {
              "columnMatch": "GeoCoordinatesMapLink",
              "formatter": 7,
              "formatOptions": {
                "linkTarget": "Url"
              }
            },
            {
              "columnMatch": "Count",
              "formatter": 4,
              "numberFormat": {
                "unit": 17,
                "options": {
                  "style": "decimal"
                }
              }
            }
          ],
          "filter": true
        },
        "sortBy": []
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 3 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| extend RiskEvent = dynamic({RiskEventTypes_V2Param})\n| extend locationDetailsJSON = parse_json(LocationDetails)\n| extend Latitude=tostring(locationDetailsJSON.geoCoordinates.latitude), Longitude=tostring(locationDetailsJSON.geoCoordinates.longitude)\n| extend GeoCoordinatesLink = strcat(\"https://bing.com/maps/default.aspx?cp=\",Latitude,\"~\",Longitude,\"&style=h&lvl=15&sp=\",\"point.\",Latitude,\"_\",Longitude,\"_\",Identity)\n| project TimeGenerated,  RiskEvent,  RiskLevelAggregated, UserId, Identity, IPAddress, Location,  Latitude, Longitude, BingMapLink=GeoCoordinatesLink\n| order by TimeGenerated desc\n \n //Bing Map Documentation: https://docs.microsoft.com/en-us/bingmaps/articles/create-a-custom-map-url\n //sp=point.latitude_longitude_titleString_notesString_linkURL_photoURL\n",
        "size": 3,
        "title": "Risk Events - Filtered by Risk Event Type",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "RiskLevelAggregated",
              "formatter": 18,
              "formatOptions": {
                "thresholdsOptions": "colors",
                "thresholdsGrid": [
                  {
                    "operator": "contains",
                    "thresholdValue": "high",
                    "representation": "redDark",
                    "text": "{0}{1}"
                  },
                  {
                    "operator": "contains",
                    "thresholdValue": "medium",
                    "representation": "orange",
                    "text": "{0}{1}"
                  },
                  {
                    "operator": "contains",
                    "thresholdValue": "low",
                    "representation": "yellow",
                    "text": "{0}{1}"
                  },
                  {
                    "text": "{0}{1}"
                  },
                  {
                    "operator": "Default",
                    "thresholdValue": null,
                    "text": "{0}{1}"
                  }
                ]
              },
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal"
                }
              }
            },
            {
              "columnMatch": "BingMapLink",
              "formatter": 7,
              "formatOptions": {
                "linkTarget": "Url",
                "linkIsContextBlade": false
              }
            },
            {
              "columnMatch": "GeoCoordinatesLink",
              "formatter": 7,
              "formatOptions": {
                "linkTarget": "Url"
              }
            },
            {
              "columnMatch": "Point",
              "formatter": 7,
              "formatOptions": {
                "linkTarget": "Url"
              }
            }
          ],
          "filter": true
        },
        "sortBy": []
      },
      "name": "Risk Events - Filtered by Risk Event Type"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\n| where RiskState == \"atRisk\" \n| where IPAddress !in (split('{FilterByIPAddress}',\",\"))\n| project TimeGenerated, CorrelationId,  IPAddress, Location, UserDisplayName, RiskEventTypes_V2, RiskEventTypes, RiskDetail, RiskState, IsRisky, RiskLevelAggregated, UserId\n| summarize count() by bin(TimeGenerated,7d), RiskEventTypes\n| render timechart   ",
        "size": 3,
        "title": "Risk Events Over Time",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 7"
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/b0e2eadb-68a3-451b-b8e3-4681b9a8368f/resourceGroups/az-woodgrove-rg/providers/Microsoft.OperationalInsights/workspaces/azb2c-woodgrove-logs"
  ],
  "styleSettings": {
    "spacingStyle": "none"
  },
  "fromTemplateId": "community-Workbooks/View Designer/Vertical Overview",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
